import { useState } from 'react';
import AccordionLayout from 'sections/Faq/FaqLayout';

const Faq = () => {
  const [activeIndex1, setActiveIndex1] = useState<number | string>(1);
  return (
    <div className='bg-fuchsia-50 dark:bg-gray-800'>
      <h2 className='lg:pt:16 pt-10 text-center font-heading text-3xl font-bold text-gray-800 dark:text-white lg:text-4xl'>
        அடிக்கடி கேட்கப்படும் கேள்விகள்
      </h2>
      <div className='px-3 pb-10 lg:pb-16'>
        <div className='mx-auto mt-10 flex max-w-6xl flex-col justify-center'>
          {data.map((items) => (
            <AccordionLayout
              title={items.Question}
              key={items.id}
              index={items.id}
              activeIndex={activeIndex1}
              setActiveIndex={setActiveIndex1}
            >
              {items.Answer}
            </AccordionLayout>
          ))}
        </div>
      </div>
    </div>
  );
};

export default Faq;

const data = [
  {
    id: 1,
    Question: 'IVF சிகிச்சையின் செலவு எவ்வளவு?',
    Answer:
      'IVF சிகிச்சையின் செலவு, ஒவ்வொரு நபரின் தனிப்பட்ட சூழ்நிலை மற்றும் சிகிச்சை தேவைகளுக்கு ஏற்ப மாறுபடும். கற்பககுடி IVF மையத்தில், நாங்கள் பல்வேறு IVF தொகுப்புகளை வழங்குகிறோம்.',
  },
  {
    id: 2,
    Question: 'IVF என்றால் என்ன?',
    Answer:
      ' IVF என்பது In Vitro Fertilization என்ற ஆங்கில சொல்லின் சுருக்கம். இதில், பெண்ணின் முட்டை (Egg) மற்றும் ஆணின் விந்தணு (Sperm) ஆய்வகத்தில் சேர்க்கப்பட்டு கருவாக உருவாக்கப்பட்டு, அதை பெண்ணின் கருப்பையில் வைத்து கர்பம் ஏற்படுத்தும் முறையாகும்.',
  },
  {
    id: 3,
    Question: 'IVF சிகிச்சை எவ்வளவு காலம் ஆகும்?',
    Answer:
      'பொதுவாக ஒரு IVF சுற்று (cycle) சுமார் 3–4 வாரங்கள் ஆகும். இதில் ஹார்மோன் மருந்துகள், முட்டை எடுக்கும் செயல்முறை, கருவாக்கம் மற்றும் கருப்பையில் வைத்து செலுத்துதல் (Embryo Transfer) இடம்பெறும்.',
  },
  {
    id: 4,
    Question: 'IVF சிகிச்சையில் வெற்றியின் வாய்ப்பு எவ்வளவு?',
    Answer:
      'வயது, உடல்நிலை, முட்டை மற்றும் விந்தணுவின் தரம் போன்ற காரணங்களின் படி வெற்றி விகிதம் மாறுபடும். பொதுவாக 25–40 வயதுக்கு இடையில் வெற்றியின் வாய்ப்பு அதிகம்.',
  },
  {
    id: 5,
    Question: 'IVF சிகிச்சையில் வலி உண்டா?',
    Answer:
      'பெரும்பாலான செயல்முறைகள் சிறிய ஊசிகள் மற்றும் சிறிய அறுவைச் சிகிச்சை மூலம் செய்யப்படுவதால், வலி மிகக் குறைவாக இருக்கும்.',
  },
  {
    id: 6,
    Question: 'IVF குழந்தைகள் சாதாரணமாகப் பிறக்குமா?',
    Answer:
      'ஆம். IVF மூலம் பிறக்கும் குழந்தைகள், இயல்பான முறையில் பிறக்கும் குழந்தைகளைப்போலவே ஆரோக்கியமாக இருப்பார்கள்.',
  },
  {
    id: 7,
    Question: 'IVF சிகிச்சைக்கு பக்கவிளைவுகள் உண்டா?',
    Answer:
      'சிலருக்கு சிறிய அளவில் வீக்கம், ஹார்மோன் மாற்றங்கள் அல்லது வயிற்றில் சற்றே தடம் இருக்கலாம். இவை பொதுவாக தற்காலிகமானவை.',
  },
  {
    id: 8,
    Question: 'IVF சிகிச்சை வெற்றியில்லையெனில் அடுத்ததாக என்ன செய்யலாம்?',
    Answer:
      ' மருத்துவர் உங்களின் நிலையை மதிப்பீடு செய்து, மீண்டும் IVF முயற்சி, ICSI, அல்லது பிற கருவுறுதல் சிகிச்சைகள் பரிந்துரைக்கலாம்.',
  },
  {
    id: 9,
    Question: 'ஏன் கர்பகுடி IVF மையத்தை தேர்வு செய்ய வேண்டும்?',
    Answer:
      'கர்பகுடி IVF மையம், நவீன தொழில்நுட்பம் மற்றும் அனுபவமிக்க மருத்துவர்களின் உதவியுடன், முன்னேற்றமான கருத்தரிப்பு சிகிச்சைகளை வழங்குகிறது. எங்கள் நிபுணர்கள் ஒவ்வொரு நோயாளிக்கும் தனிப்பட்ட பராமரிப்பை வழங்கி, சிறந்த முடிவுகளைப் பெற உறுதியாக செயல்படுகின்றனர்.',
  },
];
